In [1]:
import pandas as pd

In [11]:
df1= pd.DataFrame({
     'city':['new york', 'chicago', 'texas'],
     'tem': [21, 14,35],
    
})

df1

       city  tem
0  new york   21
1   chicago   14
2     texas   35

In [7]:
df2= pd.DataFrame({
     'city':['new york', 'chicago', 'texas'],
     'humidity': [65, 55,50],
    
})

df2

       city  humidity
0  new york        65
1   chicago        55
2     texas        50

In [8]:
pd.merge(df1,df2,on='city')

       city  tem  humidity
0  new york   21        65
1   chicago   14        55
2     texas   35        50